# Импликация   'x → y'   'x <= y'
# Или          'x ∨ y'   'x or y'
# И            'x ∧ y'   'x and y'
# Не           ' ¬ x '   'not x'
# Эквиваленция 'x ≡ y'   'x == y'


"""
Для какого наибольшего целого числа А формула

    ((x ≤ 9) →(x ⋅ x ≤ A)) ⋀ ((y ⋅ y ≤ A) → (y ≤ 9))

тождественно истинна, то есть принимает значение 1 при любых целых неотрицательных x и y?
"""

# for a in range(0, 300):
#     k=0
#     for x in range(1, 301):
#         for y in range(1, 301):
#             if ((x <= 9) <= (x * x <= a)) and ((y * y <= a) <= (y <= 9)):
#                 k +=1
#     if k==90000:
#         print(a)


"""
Обозначим через m&n поразрядную конъюнкцию неотрицательных целых чисел m и n.
Для какого наименьшего неотрицательного целого числа А формула всега истинна 

    x&17 = 0 → (x&29 ≠ 0 → x&А ≠ 0)
"""

# for A in range(0, 1000):
#     k=0
#     for x in range(0, 1000):
#         if (x&17 == 0) <= ((x&29 != 0) <= (x&A != 0)):
#             k=k+1
#
#     if k==1000:
#         print(A)


"""
На числовой прямой даны два отрезка: P = [5, 30] и Q = [14, 23]. 
Укажите наибольшую возможную длину промежутка A, для которого формула
    ((x ∈ P) ≡ (x ∈ Q)) → ¬(x ∈ A)
тождественно истинна, то есть принимает значение 1 при любом значении переменной х.

На числовой прямой даны два отрезка: P = [130; 171] и Q = [150; 185]. Укажите наименьшую возможную длину такого отрезка A, что формула

(x ∈ P) → (((x ∈ Q) ∧ ¬(x ∈ A)) → ¬(x ∈ P))
"""

from itertools import permutations

data = []
for a, b in permutations([130, 150, 171, 185], 2):
    if a < b:
        A = range(a, b)
        P = range(130, 171)
        Q = range(150, 185)

        for x in range(-100, 200):
            if not((x in P) <= (((x in Q) and (x not in A)) <= (x not in P))):
                break
        else:
            data.append(b-a)

print(min(data))
