# x.count(a)  сколько a в x
# bin(x)      в двоичную
# hex(x)      в шестнадцатиричную
# oct(x)      в восьмиричную
# int(a, b)   число 'а' системы счисления b в 10 систему счисления

"""
    28x218 + 93x512
В записи чисел переменной x обозначена неизвестная цифра из алфавита десятичной системы счисления.
Определите наименьшее значение x, при котором значение данного арифметического выражения кратно 133.
Для найденного значения x вычислите частное от деления значения арифметического выражения на 133 и
укажите его в ответе в десятичной системе счисления. Основание системы счисления в ответе указывать не нужно.
"""

# for a in '0123456789':
#     b = int(f'28{a}2', 18) + int(f'93{a}5', 12)
#     if b % 133 == 0:
#         print(b / 133)
#         break


"""
Значение выражения 1255 + 259 − 30? записали в системе счисления с основанием 5.
Сколько цифр 4 содержится в этой записи?
"""


# def convert(num_sys, num):
#     new_num = ''
#     while num > 0:
#         new_num += str(num % num_sys)
#         num //= num_sys
#     return new_num
#
#
# print(convert(5, 125 ** 5 + 25 ** 9 - 30).count('4'))

"""
    8x78y13 + 79xy718

В записи чисел переменными x и y обозначены допустимые в данных системах счисления неизвестные цифры.
Определите значения x и y, при которых значение данного арифметического выражения будет наименьшим и кратно 9.
Для найденных значений x и y вычислите частное от деления значения арифметического выражения на 9 и
укажите его в ответе в десятичной системе счисления. Основание системы счисления в ответе указывать не нужно.
"""


# min_num = 99999999999
# for x in '0123456789ABCDEF':
#     for y in '0123456789ABCDEF':
#         num = int(f'8{x}78{y}', 13) + int(f'79{x}{y}7', 18)
#         if min_num > num and num % 23 == 0:
#             min_num = num
# print(min_num/23)
